const { Markup } = require("telegraf");
const locale = require("../../locale");
async (ctx, next) => ctx.state.user.status == 1 && next();

module.exports = (ctx) =>
  ctx
    .replyOrEdit(
      `<b>🆘 Помощь по админ-панели бота</b>

ℹ️ Команды:
<b>/admin — открывает админ-панель
/settings — открывает настройки бота
/all — отправить рассылку
/users — список пользователей
/countries — список стран
/services — список сервисов
/ads — список объявлений
/requests — список заявок
/user @username или /user ID — показывает информацию и управление пользователем
/ad ID — показывает информацию и управление объявлением
/profit ID — показывает информацию и управление профитом
/bin BIN — показывает информацию о бине
/leavealllogs — отказ от всех логов
/euwork — встать на вбив / уйти с вбива


/setrequestsgroup — устанавливает группу, в которую будут отправляться заявки пользователей
/setallgroup — устанавливает группу общего чата воркеров
/setpayoutschannel — устанавливает канал выплат
/setlogsgroup — устанавливает группу, в которую будут отправляться логи мамонтов
/setprivateloggroup — устанавливает группу, в которую будут отправляться приватные логи
/setlogginggroup — устаналивает группу, в которую будут идти логи о действиях пользователей 
/setaccountinggroup — устаналивает группу, в которую будут идти логи о подсчете бухгалтерии 
/setsupportgroup — устаналивает группу, в которую будут идти логи о жалобах/багах


</b>
`,
      {
        parse_mode: "HTML",
        reply_markup: Markup.inlineKeyboard([
          [Markup.callbackButton(locale.go_back, "admin")],
        ]),
      }
    )
    .catch((err) => err);
